testCases/DuctFlow_AR1_Reb3500/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "11000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
2304
(
(0.0256243 2.01706e-17 -5.28623e-17)
(0.025589 6.0844e-17 5.07741e-18)
(0.0255225 5.4169e-17 1.44648e-18)
(0.0254279 3.4069e-17 2.68107e-19)
(0.0253081 3.23529e-17 2.88254e-19)
(0.0251652 2.94068e-17 6.77158e-19)
(0.0250009 2.70023e-17 4.01028e-19)
(0.0248167 2.18623e-17 4.0985e-19)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    walls
    {
        type            noSlip;
    }
    symPlanes
    {
        type            symmetry;
    }
}


// ************************************************************************* //
