testCases/DuctFlow_AR1_Reb3500/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "11000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
2304
(
1.96181e-05
1.95631e-05
1.94596e-05
1.93132e-05
1.91283e-05
1.89091e-05
1.86587e-05
1.83803e-05
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    walls
    {
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        type            kLowReWallFunction;
        value           nonuniform List<scalar> 
96
(
2.23895e-15
5.1007e-14
3.03033e-13
1.01935e-12
2.56605e-12
5.41919e-12
1.01553e-11
1.74167e-11
...
)
;
    }
    symPlanes
    {
        type            symmetry;
    }
}


// ************************************************************************* //
