testCases/DuctFlow_AR1_Reb3500/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "11000";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
2304
(
2465.53
2465.53
2465.53
2465.53
2465.53
2465.53
2465.53
2465.53
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    walls
    {
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
96
(
2465.5
2465.5
2465.5
2465.5
2465.5
2465.5
2465.5
2465.5
...
)
;
    }
    symPlanes
    {
        type            symmetry;
    }
}


// ************************************************************************* //
