testCases/DuctFlow_AR1_Reb3500/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2304;
        startFace       4512;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          2304;
        startFace       6816;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       9120;
    }
    symPlanes
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          96;
        startFace       9216;
    }
)

// ************************************************************************* //
