testCases/DuctFlow_AR1_Reb3500/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          turbulenceProperties;
}

simulationType  RAS;

RAS
{
    RASModel        kOmegaSSTEARSCM2D; 

    \\Optional Coefficients
    EARSCM          2;          \\ 0:off | 1:ModelI | 2:ModelII
    C0I             -1.653;     \\C0 for ModelI
    C1I             0.625;      \\C1 for ModelI
    C2I             1;          \\C2 for ModelI
    C0II            -0.061;     \\C0 for ModelII
    C1II            -0.163;     \\C1 for ModelII
    C2II            1;          \\C2 for ModelII
    bijDeltaRelax   0.5;        \\Relaxation factor in updating bijDelta
}



// ************************************************************************* //
